mixly/SMeshStudio/mcore/hw/arduino/samd/boards.txt
#ARDUINO M0 PRO (WITH) BOOTLOADER - PROGRAMMING PORT
arduino_zero_pro_bl_dbg.name=Arduino M0 Pro (Programming Port)
arduino_zero_pro_bl_dbg.vid.0=0x03eb
arduino_zero_pro_bl_dbg.pid.0=0x2111
arduino_zero_pro_bl_dbg.upload.tool=openocd
arduino_zero_pro_bl_dbg.upload.protocol=sam-ba
arduino_zero_pro_bl_dbg.upload.maximum_size=262144
arduino_zero_pro_bl_dbg.upload.use_1200bps_touch=false
arduino_zero_pro_bl_dbg.upload.wait_for_upload_port=false
arduino_zero_pro_bl_dbg.upload.native_usb=false
arduino_zero_pro_bl_dbg.build.mcu=cortex-m0plus
arduino_zero_pro_bl_dbg.build.f_cpu=48000000L
arduino_zero_pro_bl_dbg.build.usb_product="Arduino M0 Pro"
arduino_zero_pro_bl_dbg.build.board=SAM_ZERO
arduino_zero_pro_bl_dbg.build.core=arduino
arduino_zero_pro_bl_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl_dbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_pro_bl_dbg.build.variant=arduino_zero
arduino_zero_pro_bl_dbg.build.variant_system_lib=
arduino_zero_pro_bl_dbg.build.vid=0x2a03
arduino_zero_pro_bl_dbg.build.pid=0x804f
arduino_zero_pro_bl_dbg.build.section.start=0x4000

arduino_zero_pro_bl_dbg.bootloader.tool=openocd
arduino_zero_pro_bl_dbg.bootloader.cmd_unprotect=at91samd bootloader 0
arduino_zero_pro_bl_dbg.bootloader.cmd_protect=at91samd bootloader 16384
arduino_zero_pro_bl_dbg.bootloader.cmd_protect_verify=at91samd bootloader
arduino_zero_pro_bl_dbg.bootloader.file=zero/Bootloader_D21_M0_Pro_150427.hex

#ARDUINO M0 PRO (WITH) BOOTLOADER - NATIVE PORT
arduino_zero_pro_bl.name=Arduino M0 Pro (Native USB Port)
arduino_zero_pro_bl.vid.0=0x2a03
arduino_zero_pro_bl.pid.0=0x004d
arduino_zero_pro_bl.vid.1=0x2a03
arduino_zero_pro_bl.pid.1=0x804d
arduino_zero_pro_bl.vid.2=0x2a03
arduino_zero_pro_bl.pid.2=0x004f
arduino_zero_pro_bl.vid.3=0x2a03
arduino_zero_pro_bl.pid.3=0x804f
arduino_zero_pro_bl.upload.tool=avrdude
arduino_zero_pro_bl.upload.protocol=stk500v2
arduino_zero_pro_bl.upload.maximum_size=262144
arduino_zero_pro_bl.upload.use_1200bps_touch=true
arduino_zero_pro_bl.upload.wait_for_upload_port=true
arduino_zero_pro_bl.upload.native_usb=true
arduino_zero_pro_bl.upload.speed=57600
arduino_zero_pro_bl.build.mcu=cortex-m0plus
arduino_zero_pro_bl.build.f_cpu=48000000L
arduino_zero_pro_bl.build.usb_product="Arduino M0 Pro"
arduino_zero_pro_bl.build.board=SAM_ZERO
arduino_zero_pro_bl.build.core=arduino
arduino_zero_pro_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl.build.variant=arduino_zero
arduino_zero_pro_bl.build.variant_system_lib=
arduino_zero_pro_bl.build.vid=0x2a03
arduino_zero_pro_bl.build.pid=0x804f
arduino_zero_pro_bl.build.section.start=0x4000
arduino_zero_pro_bl.build.emu.mcu=atmega2560
arduino_zero_pro_bl.bootloader.tool=avrdude
arduino_zero_pro_bl.bootloader.low_fuses=0xff

#ARDUINO M0 (WITH) BOOTLOADER
arduino_zero_bl.name=Arduino M0
arduino_zero_bl.vid.0=0x2a03
arduino_zero_bl.pid.0=0x004d
arduino_zero_bl.vid.1=0x2a03
arduino_zero_bl.pid.1=0x804d
arduino_zero_bl.vid.2=0x2a03
arduino_zero_bl.pid.2=0x004e
arduino_zero_bl.vid.3=0x2a03
arduino_zero_bl.pid.3=0x804e
arduino_zero_bl.upload.tool=avrdude
arduino_zero_bl.upload.protocol=stk500v2
arduino_zero_bl.upload.maximum_size=262144
arduino_zero_bl.upload.use_1200bps_touch=true
arduino_zero_bl.upload.wait_for_upload_port=true
arduino_zero_bl.upload.native_usb=true
arduino_zero_bl.upload.speed=57600
arduino_zero_bl.build.mcu=cortex-m0plus
arduino_zero_bl.build.f_cpu=48000000L
arduino_zero_bl.build.usb_product="Arduino M0"
arduino_zero_bl.build.board=SAM_ZERO
arduino_zero_bl.build.core=arduino
arduino_zero_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_bl.build.variant=arduino_zero
arduino_zero_bl.build.variant_system_lib=
arduino_zero_bl.build.vid=0x2a03
arduino_zero_bl.build.pid=0x804e
arduino_zero_bl.build.section.start=0x4000
arduino_zero_bl.build.emu.mcu=atmega2560
arduino_zero_bl.bootloader.tool=avrdude
arduino_zero_bl.bootloader.low_fuses=0xff